In [2]:
library(DBI)
library(RMySQL)

Warning message:
"package 'RMySQL' was built under R version 3.4.4"

In [3]:
con <- dbConnect(RMySQL::MySQL(), 
                 dbname = "tweater", 
                 host = "courses.csrrinzqubik.us-east-1.rds.amazonaws.com", 
                 port = 3306,
                 user = "goldengate",
                 password = "*****")

In [6]:
dbListTables(con)

[1] "comments" "tweats"   "users"

In [7]:
mysql_con <- dbSendQuery(con , " select * from tweats")

In [8]:
mysql_data <- fetch(mysql_con , n = -1 )

In [9]:
mysql_data

  id user_id
1 75 3
2 88 4
3 77 6
4 87 5
5 49 1
6 24 7
  post
1 break egg. bake egg. eat egg.
2 wash strawberries. add ice. blend. enjoy.
3 2 slices of bread. add cheese. grill. heaven.
4 open and crush avocado. add shrimps. perfect starter.
5 nachos. add tomato sauce, minced meat and cheese. oven for 10 mins.
6 just eat an apple. simply and healthy.
  date
1 2015-09-05
2 2015-09-14
3 2015-09-21
4 2015-09-22
5 2015-09-22
6 2015-09-24